# Задача 2: Найдите сумму цифр трехзначного числа.
#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0) 

print("Введите трёхзначное число")
x = input()
print(int(x[0]) + int(x[1]) + int(x[2]))