main_menu = '''\nУ нас есть имитация справочника номеров в формате .txt, выберите действие: 
1. Вывод справочника. \n 
2. Добавить контакт. \n 
3. Найти контакт. \n 
4. Редактировать контакт. \n 
5. Удалить контакт. \n 
6. Выход.
'''
input_error = "Ошибка ввода."

AddNC_name = "Введите фамилию и инициалы контакта: "
AddNC_adress = "Введите адрес: "
AddNC_phone = "Введите номер телефона: "

find_contact = "Введите фамилию или телефон контакта: "

EditC_to_edit = "Что нужно изменить? \n 1. ФИО. \n 2. Адрес. \n 3. Телефон.\n"
EditC_name = "Введите ФИО контакта: "
EditC_adress = "Введите новый адрес контакта: "
EditC_phone = "Введите новый телефон контакта: "

DeleteC_surname = "Введите фамилию контакта: "